package com.day05;

/**
 * @author FunnyPrince_
 * @date 2021/3/27 - 21:24
 *
 * 面向对象学习三条主线：
 * 1.java类及类的成员、属性、方法、构造器；代码块、内部类
 * 2.面向对象的三大特征：封装性、集成性、多态性
 * 3.其他关键字：this/super/static/final/abstract/interface/
 *
 * 二、人把大象装进冰箱
 * 1.面向过程：强调的是功能行为，以函数为最小单位，考虑怎么做。
 *      >打开冰箱门
 *      抬起大象，塞进冰箱
 *      把冰箱门打开
 * 2.面向对象：强调了具备了功能的对象，以类/对象为最小单位，考虑谁来做
 *      >人{
 *          打开（冰箱）{
 *              冰箱.开开（）；
 *          }
 *          抬起（大象（{
 *              大象 .进入（冰箱）；
 *          }
 *          关闭(冰箱){
 *              冰箱.闭合（）；
 *          }
 *      }
 *
 *      >冰箱{
 *          开开(){};
 *          闭合(){};
 *      }
 *
 *      >大象{
 *          进入(冰箱){
 *          }
 *      }
 *
 */
public class OPPTest {
    public static void main(String[] args) {


    }


}
